# CreateReferenceInLink Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Reference..::..CreateReferenceInLink Method
Reference Class See Also
---
Creates a Reference in an RVT Link from a Reference in the RVT host file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Reference CreateReferenceInLink()
```

Visual Basic
---
```text
Public Function CreateReferenceInLink As Reference
```

Visual C++
---
```text
public:
Reference^ CreateReferenceInLink()
```

# See Also
Reference Class
Autodesk.Revit.DB Namespace